#include <stdio.h>
#include <iostream>

using namespace std;

int main(void)
{

    int itext[658];
    int ioriginal[658];

    int raznost[658];

    int rasshifrovka1[658];
    char rasshifrovka1_s[658];

    char ABC[] = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
    char text[] = "шзэйёсгшьисёлтиувеарчвревгацвюрёюцстеыювяывфчыэдшжаёхыгмьъэаёытаввэйаеябьяхбриаошшссьцяубцбйецяйтэцоебъцьгцоушцъьчциюедпдсжгвъсошчммучмнвбвпэцгпядзётжьйаыгмьицвшёвпмыавнхгоьинйгеьбыцдэгжъойябьиябпхывхяеейюехйбъшёюояшшгбсьщаувшъупиъсугътжыгмьзвёчядгвяжцвчтйшздэдцгщьквпхбсцшоцкзцщиьдфоуёътудъёрбгряеыувшърдеийшжцгшжгёдзьйшжсевздйгжъцвъъгцегуьйябеыгупгяпъыгухеъоёывёедмцыцхбкдсеюедпдсюйаешовёамвгсупщамвшеоьэцюёешёееавмыяйшёвпчйтмьжагудатюеяуубдбаясгвиървхумтыдттбслвадпешриудяьэицлеиугьъцвжбагвбуйъыяёдшгёёцьйеъцмувггвыхёяецтяядькядбшонюёеюьёеиовэхёаицвтшфпеиъовндпфсбпбхдэкиауоиашбеоувнъууыйэбцбйляябадсрвндфузаддяябеетбюцпюеугтьиашюцвфевагвяглдциёяъагеивёкя";
    char original[] = "еслитысчитаешьчтооопдлядомохозяекаассемблеруделгероевеслидлятебяоллимонаиидаэтоневариантнаписанияженскихименавещибезкоторыхводанебылабымокройасолнцеяркимеслитебепрощеобъяснитьипоказать";

    //-----------------------------------------------------------------------------

    cout << "Номер   Шифровка  Текст  Разность\n";

    for(int i=0; i<184; i++)
    {
        for(int j=0; j<33; j++)
        {
            if(text[i] == ABC[j])
            {
                itext[i] = j;
            }

            if(original[i] == ABC[j])
            {
                ioriginal[i] = j;
            }
        }

        raznost[i] = itext[i] - ioriginal[i];

        cout << i+1 << "   ||      " << ioriginal[i] << "       " << itext[i] << "      " << raznost[i] << "\n";
    }

    cout << "\n\n";

    //--------------------------------------------------------------------------------

    //первый вариант ключа
    for(int i=0; i<184; i++)
    {
        if(i%4 == 0)
            cout << "\n";

        if(raznost[i]<0)
            raznost[i] += 33;

        cout << raznost[i] << " ";
    }
    cout << "\n\n";
    //вывод ключа
    int key1[4];
    for(int i=0; i<4;i++)
    {
        key1[i] = raznost[i];
        cout << ABC[(key1[i])];
    }

    cout << "\n\n";

    //-------------------------------------------------------------------------------

    //второй вариант ключа
    for(int i=0; i<184; i++)
    {
        if(i%4 == 0)
            cout << "\n";

        if(raznost[i]>0)
        {
            raznost[i] -= 33;
            raznost[i] = abs(raznost[i]);
        }

        cout << raznost[i] << " ";
    }
    cout << "\n\n" ;
    //вывод ключа
    int key2[4];
    for(int i=0; i<4;i++)
    {
        key2[i] = raznost[i];
        cout << ABC[(key2[i])];
    }

    //--------------------------Расшифровка--------------------------------------------------------

    //Подходит только первый ключ

    for(int i=0; i<658; i++)
    {
        for(int j=0; j<33; j++)
        {
            if(text[i] == ABC[j])
            {
                itext[i] = j;
            }
        }
    }

     cout << endl << rasshifrovka1_s;

    for(int i=0, j=0; i<658; i++, j++)
    {
        if(j == 4) j = 0;

        rasshifrovka1[i] = itext[i] - key1[j];

        if(rasshifrovka1[i] < 0) rasshifrovka1[i] += 33;

        rasshifrovka1_s[i] = ABC[(rasshifrovka1[i])];
    }

    //---------------------------Запись в файл---------------------------------------------------

    cout << endl << rasshifrovka1_s;

    FILE *f=fopen("pro.txt","w");
    if(f==NULL)
        printf("Ошибка открытия файла!");
    fwrite(rasshifrovka1_s, sizeof(char), 658, f);
    fclose(f);
}

